cmsis-svd/cmsis-svd/data/Renesas/R7FA2L1AB.svd
                <register>
                    <name>ADCMPBSR</name>
                    <description>A/D Compare Function Window B Status Register</description>
                    <addressOffset>0x0AC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>CMPSTB</name>
                            <description>Compare Window B Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Comparison conditions are not met.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Comparison conditions are met.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADSSTRL</name>
                    <description>A/D Sampling State Register</description>
                    <addressOffset>0x0DD</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0d</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling Time Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADSSTRT</name>
                    <description>A/D Sampling State Register</description>
                    <addressOffset>0x0DE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0d</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling Time Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADSSTRO</name>
                    <description>A/D Sampling State Register</description>
                    <addressOffset>0x0DF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0d</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling Time Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>15</dim>
                    <dimIncrement>0x1</dimIncrement>
                    <dimIndex>0-14</dimIndex>
                    <name>ADSSTR%s</name>
                    <description>A/D Sampling State Register</description>
                    <addressOffset>0x0E0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0d</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling Time Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>DAC12</name>
            <description>12-bit D/A converter</description>
            <baseAddress>0x4005E000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DADR0</name>
                    <description>D/A Data Register 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>DACR</name>
                    <description>D/A Control Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1f</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>DAOE0</name>
                            <description>D/A Output Enable 0</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable analog output of channel 0 (DA0) </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable D/A conversion of channel 0 (DA0) </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DADPR</name>
                    <description>DADR0 Format Select Register</description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>DPSEL</name>
                            <description>DADR0 Format Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Right-justified format</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Left-justified format</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAADSCR</name>
                    <description>D/A A/D Synchronous Start Control Register</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>DAADST</name>
                            <description>D/A A/D Synchronous Conversion</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not synchronize DAC12 with ADC12 operation (disable interference reduction between D/A and A/D conversion).</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Synchronize DAC12 with ADC12 operation (enable interference reduction between D/A and A/D conversion).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAVREFCR</name>
                    <description>D/A VREF Control Register</description>
                    <addressOffset>0x07</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>REF</name>
                            <description>D/A Reference Voltage Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No reference voltage selected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AVCC0/AVSS0 selected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
