cmsis-svd/cmsis-svd/data/Renesas/R7FA2L1AB.svd
                                    <description>Normal</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Invert</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUDBGR0</name>
                    <description>CTSU Calibration Register</description>
                    <alternateRegister>CTSUCALIB</alternateRegister>
                    <addressOffset>0x28</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUDBGR1</name>
                    <description>CTSU Calibration Register</description>
                    <alternateRegister>CTSUCALIB</alternateRegister>
                    <addressOffset>0x2A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSUCLKA</name>
                    <description>CTSU Sensor Unit Clock Control Register A</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>CTSUSUCLK0</name>
                    <description>CTSU Sensor Unit Clock Control Register A</description>
                    <alternateRegister>CTSUSUCLKA</alternateRegister>
                    <addressOffset>0x2C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSUCLK1</name>
                    <description>CTSU Sensor Unit Clock Control Register A</description>
                    <alternateRegister>CTSUSUCLKA</alternateRegister>
                    <addressOffset>0x2E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSUCLKB</name>
                    <description>CTSU Sensor Unit Clock Control Register B</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SUADJ2</name>
                            <description>CTSU SUCLK Frequency Adjustment</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUMULTI2</name>
                            <description>CTSU SUCLK Multiplier Rate Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUADJ3</name>
                            <description>CTSU SUCLK Frequency Adjustment</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUMULTI3</name>
                            <description>CTSU SUCLK Multiplier Rate Setting</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSUCLK2</name>
                    <description>CTSU Sensor Unit Clock Control Register B</description>
                    <alternateRegister>CTSUSUCLKB</alternateRegister>
                    <addressOffset>0x30</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSUCLK3</name>
                    <description>CTSU Sensor Unit Clock Control Register B</description>
                    <alternateRegister>CTSUSUCLKB</alternateRegister>
                    <addressOffset>0x32</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUCFCCNT</name>
                    <description>CTSU CFC Counter Register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFCCNT</name>
                            <description>CTSU CFC Counter</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUCFCCNTL</name>
                    <description>CTSU CFC Counter Register</description>
                    <alternateRegister>CTSUCFCCNT</alternateRegister>
                    <addressOffset>0x34</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
